In [1]:
import pandas as pd # Import pandas library and assign it the alias 'pd'
series=pd.Series([10,20,30,40,50])   # Create a pandas Series from a list
print(series)  # Print the Series

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [3]:
import pandas as pd  # Import pandas library and assign it the alias 'pd'

# Define a dictionary 'data' that contains lists of values for each column
data = {
    "Name": ["Alice", "Bob", "Charlie"],  # List of names
    "Age": [25, 30, 35],                  # List of ages
    "City": ["New York", "Los Angeles", "Chicago"]  # List of cities
}

# Create a DataFrame using the data dictionary
df = pd.DataFrame(data)

# Print the DataFrame
print(df)

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [3]:
print(df.head())  # Print the first  rows of the DataFrame

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [4]:
df.info()   #display the Dataframe summary information

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   City    3 non-null      object
dtypes: int64(1), object(2)
memory usage: 204.0+ bytes

In [5]:
df.describe()  #get the descriptive statistics

        Age
count   3.0
mean   30.0
std     5.0
min    25.0
25%    27.5
50%    30.0
75%    32.5
max    35.0

In [6]:
print(df['Name'])  # Print the 'Name' column

0      Alice
1        Bob
2    Charlie
Name: Name, dtype: object

In [7]:
# Filter the DataFrame where 'Age' > 30
filtered_df = df[df["Age"] > 30]
# Print the filtered DataFrame
print(filtered_df)

      Name  Age     City
2  Charlie   35  Chicago

In [8]:
# Select specific rows and columns using .loc
selected_data = df.loc[[0, 1], ["Name", "City"]]
# Print the selected data
print(selected_data)

    Name         City
0  Alice     New York
1    Bob  Los Angeles

In [9]:
df  #display the dataframe

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [10]:
# Select specific rows (0 and 2) and columns ('Name' and 'City')
selected_data = df.loc[[0, 2], ["Name", "City"]]
# Print the selected data
print(selected_data)

      Name      City
0    Alice  New York
2  Charlie   Chicago

In [11]:
# Filter the DataFrame where 'Age' > 30 and select 'Name' and 'City' columns
filtered_data = df.loc[df["Age"] > 30, ["Name", "City"]]
# Print the filtered data
print(filtered_data)

      Name     City
2  Charlie  Chicago

In [12]:
# Use .iloc to select the first two rows and the first two columns
selected_data = df.iloc[0:2, 0:2]
# Print the selected data
print(selected_data)

    Name  Age
0  Alice   25
1    Bob   30

In [14]:
Ù# Add a new column 'Salary'
df["Salary"] = [50000, 60000, 70000]
# Print the updated DataFrame
print(df)

      Name  Age         City  Salary
0    Alice   25     New York   50000
1      Bob   30  Los Angeles   60000
2  Charlie   35      Chicago   70000

In [16]:
# Add 1 to each value in the 'Age' column
df['Age'] = df['Age']+1
# Print the updated DataFrame
print(df)

      Name  Age         City  Salary
0    Alice   26     New York   50000
1      Bob   31  Los Angeles   60000
2  Charlie   36      Chicago   70000

In [27]:
df = df.drop['City' ]
print(df)

TypeError: 'method' object is not subscriptable

In [28]:
# Create a DataFrame with NaN values
df_with_nan = pd.DataFrame({'A' :[1,2, None ],'B': [4,None,6]})
# Check for NaN (null) values
print(df_with_nan.isnull())

       A      B
0  False  False
1  False   True
2   True  False

In [29]:
# Create a DataFrame with NaN values
df_with_nan = pd.DataFrame({'A' :[1,2, None ],'B': [None,None,6]})
# Display the DataFrame
df_with_nan

     A    B
0  1.0  NaN
1  2.0  NaN
2  NaN  6.0

In [30]:
df_with_nan.isnull() # Check for NaN (null) values

       A      B
0  False   True
1  False   True
2   True  False

In [33]:


# Sample dictionary
student_dict = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [20, 22, 23, 21],
    'Grade': ['A', 'B', 'A', 'C']
}

# Create a DataFrame with a custom index
student_df = pd.DataFrame(student_dict, index=['a', 'b', 'c', 'd'])

# Display the DataFrame
print(student_df)

      Name  Age Grade
a    Alice   20     A
b      Bob   22     B
c  Charlie   23     A
d    David   21     C

In [34]:
student_df.fillna(0)

      Name  Age Grade
a    Alice   20     A
b      Bob   22     B
c  Charlie   23     A
d    David   21     C

In [35]:
# Fill NaN in column 'A' with the mean of column 'A'
df_with_nan ['A']= df_with_nan['A'].fillna(df_with_nan['A'].mean())
# Display the updated DataFrame
df_with_nan

     A    B
0  1.0  NaN
1  2.0  NaN
2  1.5  6.0

In [36]:
# Fill NaN in column 'B' with the mean of column 'B'
df_with_nan ['B']= df_with_nan['B'].fillna(df_with_nan['B'].mean())
# Display the updated DataFrame
df_with_nan

     A    B
0  1.0  6.0
1  2.0  6.0
2  1.5  6.0

In [40]:
student_dict = {
    'Name': ['Joe', 'Ali', 'Baraa', 'Tala'],
    'Age': [20, None, 40, 35],
    'Marks': [None, None, 95, 80]
}

# Create DataFrame from the dictionary with custom index
student_df = pd.DataFrame(student_dict, index=['a', 'b', 'c', 'd'])

# Display the DataFrame
print(student_df)

    Name   Age  Marks
a    Joe  20.0    NaN
b    Ali   NaN    NaN
c  Baraa  40.0   95.0
d   Tala  35.0   80.0

In [42]:
student_df["Marks"].mean()

87.5

In [43]:
student_df["Marks"].fillna(student_df["Marks"].mean())

a    87.5
b    87.5
c    95.0
d    80.0
Name: Marks, dtype: float64

In [45]:
# Drop rows with any NaN values
cleaned_df = df_with_nan.dropna()
# Display the cleaned DataFrame
print(cleaned_df)

     A    B
0  1.0  6.0
1  2.0  6.0
2  1.5  6.0

In [49]:


# Sample DataFrame creation
data = {'Name': ['HR', 'IT', 'HR', 'IT'],
        'Salary': [50000, 60000, 70000, 80000]}

df = pd.DataFrame(data)

# Define the custom function to double the salary
def double_salary(x):
    return x * 2

# Apply the function to the 'Salary' column
df['Double Salary'] = df['Salary'].apply(double_salary)

# Print the updated DataFrame
print(df)

  Name  Salary  Double Salary
0   HR   50000         100000
1   IT   60000         120000
2   HR   70000         140000
3   IT   80000         160000

In [53]:


# Sample DataFrame df_age_sex
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Sex': ['female', 'male', 'male', 'female'],
        'Age': [25, 30, 35, 40]}

df_age_sex = pd.DataFrame(data)

# Define the custom function to convert gender to a boolean
def Get_Gender_Bool(gender):
    if gender == "male":
        return 1
    else:
        return 0

# Apply the function to the 'Sex' column
df_age_sex["Bool_Male"] = df_age_sex["Sex"].apply(Get_Gender_Bool)

# Print the updated DataFrame
print(df_age_sex)

      Name     Sex  Age  Bool_Male
0    Alice  female   25          0
1      Bob    male   30          1
2  Charlie    male   35          1
3    David  female   40          0

In [56]:


# Sample DataFrame
data = {'Name': ['Mr. John Smith', 'Dr. Alice Brown', 'Mr. Bob Lee', 'Ms. Clara Jane'],
        'Age': [34, 29, 42, 31]}

df_name_age = pd.DataFrame(data)

# Define the custom function to extract the title
def Get_Title(name):
    parsed_name = name.split(" ")
    # Handle cases where the name doesn't have a title (e.g., single-part names)
    if len(parsed_name) > 1:
        return parsed_name[0]  # First part is the title
    else:
        return None  # Return None if there is no title

# Apply the function to the 'Name' column
df_name_age["Title"] = df_name_age["Name"].apply(Get_Title)

# Display the updated DataFrame
print(df_name_age)

              Name  Age Title
0   Mr. John Smith   34   Mr.
1  Dr. Alice Brown   29   Dr.
2      Mr. Bob Lee   42   Mr.
3   Ms. Clara Jane   31   Ms.

In [58]:

df = pd.DataFrame({
    'Name': ['HR', 'IT', 'HR', 'IT'],
    'Salary': [50000, 60000, 70000, 80000]
})


df.rename(columns={'Name': 'Department'}, inplace=True)


grouped = df.groupby('Department').mean()


print(grouped)

             Salary
Department
HR          60000.0
IT          70000.0

In [ ]:

df = pd.DataFrame({
    'Department': ['HR', 'IT', 'HR', 'IT'],
    'Salary': [50000, 60000, 70000, 80000]
})


average_salary_by_dept = df.groupby('Department')['Salary'].mean()


print("Average Salary by Department:\n")
print(average_salary_by_dept.head())